#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-tN53CitRYEfkP7UF

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_collaborator.quarkus_operator_sdk["metacosm"] will be created
  + resource "github_repository_collaborator" "quarkus_operator_sdk" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "quarkus-operator-sdk"
      + username                    = "metacosm"
    }

  # github_repository_collaborator.quarkus_operator_sdk["xstefank"] will be created
  + resource "github_repository_collaborator" "quarkus_operator_sdk" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "quarkus-operator-sdk"
      + username                    = "xstefank"
    }

  # github_team_membership.quarkus_discord4j["cottoncammy"] will be created
  + resource "github_team_membership" "quarkus_discord4j" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6732488"
      + username = "cottoncammy"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*